//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	Thank you for downloading the Beam Drill Pack! This mod adds 19 new tools, all of which are modled after or inspired by the Vanilla Laser Drill. The purpose of
//	this mod is to give the player fast tools early on, so as to avoid the slog of using the sluggish pre-hardmode tools. However, the mining power of the power of
//	the Beam Drills is dependant on what material they are made from. This is intended to expidite tedious chores while still preserving the game's normal progression.
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	
//	A configuration setting called "EasyMode" may be changed to suit your preferences in My Games/Terraria/ModLoader/ModConfigs/BeamDrillPack.
// 	If you would prefer to gain access to the lowest-tier Beam Drill variations very soon after starting the game, set this setting to "TRUE".
//	If you prefer to have to do a little work to earn your first Beam Drill, set this setting to "FALSE".
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	FALSE: The lowest tier Beam Drill will be the Meteor Beam Drill, crafted at an anvil using 20 meteorite bars, 10 emeralds, and a lens.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	TRUE: Enables crafting of the Copper Beam Drill at an anvil, using a copper pickaxe, a glowstick, and a lens.
//	Also enables crafting of the Tin Beam Drill at an anvil, using a tin pickaxe, a glowstick, and a lens.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////